package controller

import (
	"github.com/gin-gonic/gin"
)

type Post struct {
	Title  string `json:"title"`
	Author string `json:"author"`
	Desc   string `json:"desc"`
}

func PostLists(c *gin.Context) {
	lists := []Post{
		{
			Title:  "",
			Author: "BrouceSong",
			Desc:   "人生在世，我们常常产生想解释点什么的想法。然而，一旦解释起来，却发现任何人解释都是那样的苍白无力，甚至还会越抹越黑。因此，做人不需要解释，便成为智者的选择。山不解释自己的高度，并不影响它的耸立云端；海不解释自己的深度，并不影响它容纳百川；地不解释自己的厚度，但没有谁能取代她作为承载万物的地位……",
		},
		{
			Title:  "",
			Author: "BrouceSong",
			Desc:   "我们一路怀揣着爱，脚踏着万物，一声绝唱，飘然落尘！也许，你我曾是几百年前的一株草，一朵花，一粒尘，经过几世轮回的转换变成了今生的亲人，朋友，爱人……也许，我们只是来兑现前世的一场盟约。也许，在百年之后，你我又都化为世间的生灵，守候在天地之间，彼此相望，相顾无言。然而，你我却心灵相犀，甘为绿叶，守护着这世间一朵花开的时光！",
		},
		{
			Title:  "",
			Author: "BrouceSong",
			Desc:   "有些人，在你生命里，走着走着就散了，走着走着就远了，转身是刹那，离别早已是天涯。有些人，如同在你的世界打马而过，走时如春风拂面，未曾留下一丝一痕。有些人，走时却如惊涛骇浪，让你痛彻心扉，就像长在你心里的一根刺，怎么拨也拨不出来，只留下浅浅淡淡的伤痕，也许，是思念;也许，是怨念;也许，只是记得……",
		},
		{
			Title:  "",
			Author: "BrouceSong",
			Desc:   "若有缘，总会有那么一个人，即便跋山涉水，历经千辛万苦，也会向你奔赴而来;如若有缘，总会有那么一个人，即便拨开万千人群，拨开姹紫嫣红，也会站在光阴的廊桥上，没有早一步，没有晚一步，只为在最美的季节里，与你相遇相知，与你在时光的铜镜里勾勒成一个完美的圆。",
		},
		{
			Title:  "",
			Author: "BrouceSong",
			Desc:   "我幸，今生在最美的时光遇见了你。张爱玲说，因为爱了，所以慈悲。因为懂得，所以宽容。总有那么一个人，即便全世界都不爱你，也会为你低眉，为你垂泪，为你留一盏温暖的灯，默默守护在你身旁，在清浅的时光里，陪你看草长莺飞，陪你数散落星辰！",
		},
		{
			Title:  "",
			Author: "BrouceSong",
			Desc:   "因为有缘，你我同住同修，同见同知，相互依靠，相互取暖。生死契阔，与子成说;执子之手，与子携老。爱，最长情的告白，不是千万句“我爱你”，也不是春花秋月前的山盟海誓，天长地久。而是愿意用其一生的光阴来陪伴你，来包容你！即便在寡味的日子里，也会用爱去浇灌，用心去呵护，为你种出一朵妖艳之花，㶷烂至极。",
		},
		{
			Title:  "",
			Author: "BrouceSong",
			Desc:   "可惜，世间不是所有的缘份都来得刚刚好，在合适的季节里你我相遇相逢。就如徐志摩遇到林徵因，写下“轻轻的我走了，正如我轻轻的来；我轻轻的招手，作别西天的云彩……”一首再别康桥道出无尽的思念，却因是一场三角之恋，不得不放手。还有张爱玲遇见文人汉奸胡兰成，在信里写道：“在你面前我变得很低很低，低到尘埃里。但我的心里是喜欢的，从尘埃里开出花来。”",
		},
		{
			Title:  "",
			Author: "BrouceSong",
			Desc:   "多么卑微，往往当一个人遇到一份情缘，再怎么高傲，冷漠。也会变得很低很低，变得温柔而多情。虽然两年后，终究两人还是劳雁纷飞，各奔东西。像天空璀璨的烟花，绽放之后只剩薄凉。也许，他们彼此相遇，只是为了来世间为我们讲述一段故事，写下一段文字，弹奏一曲琴瑟之音！世间，不是所有的缘份与感情都能修得正果，厮守一生。但它们如同投在你心湖的一颗石子，荡起层层微光，即便短暂，仍也波光粼粼，晶莹闪烁！",
		},
		{
			Title:  "",
			Author: "BrouceSong",
			Desc:   "是啊！人生的缘份就是如此奇妙，像一朵浮云与飞鸟的相逢，不期而至。眉间滑过的光阴，犹如那山涧流淌的溪泉，平缓而柔软。而你我，就如同飘飞的枫叶，相遇相逢，徐徐飘落，寂静悠美，直至泥土。如若有缘，此生你我注定会在光阴的渡口相见，如若离散，请在我筑起的幽梦里，互道一声“珍重”！",
		},
		{
			Title:  "",
			Author: "BrouceSong",
			Desc:   "时光荏苒，白驹过隙，一晃就是四十七年，我们重相聚。那年我们离开学校，年级的毕业典礼，简单而乏味，没有热烈的拥抱告别、没有拍照留影。离开校园时，我班的同学要求班主任到照相馆，一定要留个影。镁光灯一闪，同学们那副稚嫩、那般青春、那股活力模样就定格在毕业照里。如今，经历了风雨的洗礼，岁月的磨砺，我们很多人都已两鬓如霜、褶皱满面，不再有年少时的青春浪漫，也不再有年轻时的蓬勃朝气，但是在我们中间却贮就了一副成熟和稳重，多了一份经世的阅历。岁月如歌，人间沧桑，我们经历了许多许多，许许多多的事情也离我们远去。",
		},
		{
			Title:  "",
			Author: "BrouceSong",
			Desc:   "金色的学生年代，有太多的感动，有太多的追忆。今天再相聚，我们沿着当年上学所走的路，回母校寻觅青春的足迹。四十七载变迁还是斑驳了痕迹，那教室、那走廊、那礼堂、那操场、那林荫道上，都经历了岁月的洗礼，还有那几棵参天的梧桐树，只能永远记忆在脑海里。校园依旧，物已原非，只有当年学子们的笑声和老师的谆谆教诲仍在耳边响起！真想用画笔描摹出它的绚丽和深意，但却怎么也画不出了童年时代滚铁圈的小伙伴和跳皮筋小女孩的身影；画不出跟自己划三八线的小同学那副严肃样和打小报告的臭屁孩那满脸的诡异；画不出嘟嘴埋怨老师管束太严厉的小脸；画不出那借来你还带有余温的那支钢笔；画不出互相帮助时的纯真友爱；画不出那不用做作业时的惬意；画不出操场上追逐的天真浪漫；画不出对那个令自己心动好久的小女孩略带羞涩的表情………！莫怪画笔萎靡，只是里面蕴藏着太多的有趣。这一切都还历历在目，深深地篆刻在脑海里，依然是这样的清晰。",
		},
		{
			Title:  "",
			Author: "BrouceSong",
			Desc:   "今天的欢聚，侃谈人生事，世态不炎凉，述说着往昔。谈笑中有人坦言自己四十七年前的劣迹；有人坦言自己曾对某个女同学的着迷。嘻嘻哈哈地，那怕是一次一次张狂的历险，如今听起来也很有意义。往昔的故事，最真，最纯，最痴，许多的粗糙和鲁莽都成了趣事回忆。一年又一年，服饰在变，一年又一年，容颜在变，没变的却是对彼此的挂念之心。今天相聚时，最多的是问侯、最多的是感慨、最多的还是儿时的那段记忆。这同学的友谊，一片纯真之情，一颗真挚之心，都体现在相逢之间，这同学的情意，来自纯真年代，都储存在芝麻般微小的记忆里。成年人的言辞没有羞怯，在幽默与揶揄的调配中，早已把人生的酸甜苦辣叙尽。如今，你还是你，我还是我，我们各自又有新的事情：孙儿的吃饭、穿衣、接送、学习，还有每天跳广场舞，还要远途旅行。哟，唠唠叨叨怎么有这么多说不完的事，青春不老去，我们还有很多很多要做的事情。",
		},
		{
			Title:  "",
			Author: "BrouceSong",
			Desc:   "啊！欢聚毕竟是短暂的，虽潋滟起沉淀的情感畅谈不尽，我们各处五湖四海、南北东西。挽留！可终究挽不住你我的去留，大家各自还有许多的事情。然“流水不因石而阻，情谊不因远而疏”，我们笃信，这次四十七年分别的再聚首，同窗间的情谊将会愈加深厚，同时我们也期盼：保重！再过十年、二十年，三十年，青春不老去，我们再相聚！待那时杖国高年的同窗重聚，那自然情趣更浓，别有一番深意！",
		},
		{
			Title:  "",
			Author: "BrouceSong",
			Desc:   "来也匆匆，去也匆匆，相聚是一种奢求，然，那份同窗之情，依然恒温窖藏于心。打开一坛陈酿之酒，它显得很香、很甜、很浓、很纯。这香甜的酒，绵柔如饴，沁人心脾，醉到了每个人的心，这同学间真情话语，早已让人满眼泪痕。醉了，醉了，情愿！呵！情愿醉它千年不醒！在这茫茫人海里，我们何其有幸能够成为同窗？成为学友？是缘分！那些从小萌生的友谊感情，始终是我们心灵的支柱，不管是浓是淡，是远是近，它一直都令我们珍惜，珍惜共同走过的那段岁月，珍惜我们在一起生活的点点滴滴。",
		},
	}
	c.JSON(200, gin.H{
		"data": lists,
		"msg":  "",
	})
}
